import Head from 'next/head'
import Header from '@components/Header'
import Footer from '@components/Footer'

export default function Home() {
  return (
    <div className="container">
      <Head>
        <title>Next.js Starter!</title>
        <link rel="icon" href="/favicon.ico" />
      </Head>

      <main>
        <Header title="خصائص و مميزات هاتف ايفون 11 !" />
        
         
 إنه عام 2022. هذا يعني أنه منذ ظهور ايفون 11 لأول مرة في عام 2019 ، رأينا بالفعل ايفون 13 و ايفون 12. (حتى أننا نبحث عن ايفون 

14 و ايفونهذا العام). أن يكون عمرك أكثر من عامين ، لكنه قد يظل خيارًا جيدًا ، خاصة وأن أبل خفضته إلى 499 دولارًا العام الماضي. هناك العديد من العوامل التي يجب مراعاتها عند شراء ايفون جديد ، بالإضافة إلى السعر وميزانيتك الشخصية ، يجب أن تفكر في الميزات التي تحتاجها في الهاتف.
        </p><a href="https://sevenimgs.com/%d8%ae%d9%84%d9%81%d9%8a%d8%a7%d8%aa-%d8%a7%d9%8a%d9%81%d9%88%d9%86-%d9%81%d8%ae%d9%85%d9%87/" target="_blank">خلفيات ايفون فخمة</a>
     
   <p className="description">
          
على سبيل المثال ، هل تمانع في استخدام جهاز ايفون يبدو وكأنه قديم بعض الشيء؟ أو هل تعتقد أن توفير عدة مئات من الدولارات أهم من حمل أحدث هاتف؟ ماذا عن 5جي  - ما مدى أهمية ذلك بالنسبة لك؟ إذا كنت تتسوق بميزانية دودة يمكن، يمكنك تنزيل افضل خلفيات ايفون فخمة مجانا و بدقة عالية فلا يزال ايفون 11 خيارًا رائعًا. على الرغم من أنك ستفقد بعض الميزات الأحدث ، إلا أن ايفون 11 يمنحك جميع الأساسيات التي تريدها من ايفون ، بما في ذلك عمر البطارية الذي يتساوى مع ايفون 12 ، وهو كاميرا مزدوجة العدسة رائعة تتضمن الوضع الليلي و معالج لا يزال سريعًا بما يكفي للمهام اليومية.

ولكن إذا كان لديك مساحة كبيرة للمناورة في ميزانيتك ، فإليك بعض الأسئلة لتطرحها على نفسك. (لأغراض هذه المقالة ، سأفترض أنك تستخدم ايفون حاليًا.) وإذا كنت لا تزال تفكر في قرارك بعد ذلك ، فإليك كيفية مقارنة ايفون 13 بالسنوات الخمس الأخيرة من ايفون وإليك قائمة أفضل 
        </p>
  <p className="description">
          
اتصال 5جي : لا يحتوي ايفون 11 على 5جي . لكن هل تحتاجه حقًا الآن؟

واحدة من أكبر الميزات المفقودة في ايفون 11 مقارنة بجهازي ايفون 13 و ايفون 12 هي اتصال 5جي . جهاز ايفون 11 هو جهاز يعمل بتقنية LTE فقط ، وإذا كنت لا تهتم بالتكنولوجيا اللاسلكية من الجيل التالي حتى الآن (الخدمة غير مكتملة في الولايات المتحدة بعد كل شيء) ، فيجب أن يناسبك ايفون 11 بشكل جيد. تذكر أن 5جي  ظهرت لأول مرة في تشكيلة ايفون 12 وأن الوصول إلى نطاقات أسرع من 5جي  يعتمد على المكان الذي تعيش فيه ، لذا فإن الذهاب إلى ايفون 12 يجعل شرائك أكثر إثباتًا للمستقبل.

جودة العرض: لن تحصل على معدل تحديث يبلغ 120 هرتز على ايفون 11 (أو ايفون 12)

يستخدم ايفون 11 شاشة LCD واضحة يتم تحديثها بمعدل 60 إطارًا في الثانية ، أو 60 هرتز. قامت أبل بتبادل هاتف ايفون 12 ، حيث زودته بشاشة اوليد ، على الرغم من أنها أبقت العرض عند 60 هرتز تمامًا مثل معظم الهواتف. عادةً ما تكون اوليدs أكثر حيوية من نظيراتها من شاشات الكريستال السائل ، مع تباين أكثر ثراءً ودرجات لون أسود أكثر حبرًا. إذا كنت تشاهد الكثير من مقاطع الفيديو على جهاز ايفون وتريد تجربة مشاهدة فائقة ، فقد تكون شاشة اوليد أكثر منطقية بالنسبة لك. يتميز ايفون 13 أيضًا بلوحة اوليد أيضًا ، على الرغم من أن أبل رفعت معدل  التحديث لطرازات برو إلى 120 هرتز. سيُترجم معدل التحديث الأسرع إلى تمرير أكثر سلاسة وسرعة عبر التطبيقات والمواقع الإلكترونية.اليك 
        </p>  <a href="https://sevenimgs.com" target="_blank">sevenimgs</a>
  
  <p className="description">
          
        </p>
  دعم البرامج: إلى متى سيحصل ايفون 11 على تحديثات برامج ايوس؟

أحدث نظام تشغيل من أبل ، ايوس 15 ، مدعوم على العديد من أجهزة ايفون القديمة ، والأقدم هو ايفون 6S 2015 (إليك كيفية تنزيل نظام التشغيل الجديد ، ولكن قد ترغب في الانتظار.) بناءً على ذلك وبعض الحسابات الذهنية السريعة ، نحن يمكن أن يستنتج أن أبل تخطط لتقديم دعم ايفون لمدة تصل إلى ست سنوات من الإطلاق. نتيجة لذلك ، مع ايفون 11 ، الذي تم الكشف عنه في عام 2019 ، يمكنك أن تشعر بالراحة مع العلم أنه يمكنك توقع التحديثات حتى عام 
  
  </main>

      <Footer />
    </div>
  )
}
